export default {
    menu: {
        home: 'صفحه اصلی',
        contactUs: 'ارتباط با ما',
        aboutUs: 'درباره جامعه',
        logo: 'IRC نسخه بتا',
    },
    page: {
        home: {
            title: {
                en: 'iran react community',
                fa: 'جامعه توسعه دهندگان ری‌اکت ایران',
            },
            subTitle: 'جامعه‌ غیرانحصاری و مشارکت جمعی توسعه‌دهندگان React و React Native'
        },
        notFound: {
            title: 'صفحه مورد نظر پیدا نشد.',
        },
        aboutUs: {
            sections: {
                whatIsCommunity: {
                    title: 'جامعه ری‌اکـت ایـران چیست؟',
                    paragraph1: 'جامعه ری‌اکت ایران یک گروه تخصصی در حوزه نرم افزار است که در تاریخ ۱۱ بهمن ۱۳۹۷ با هدف آشنایی و مشارکت توسعه‌دهندگان و علاقمندان به کتابخانه متن باز ری‌اکت جی اس و ری‌اکت نیتیو به کمک جمعی از فعالان این حوزه شروع به کار کرد. ',
                    paragraph2: 'این جامعه در ابتدا با کمتر از ۴ عضو در تلگرام فعال شد و در کمتر از دو روز بیش از ۲۵۶ نفر به آن پیوستند.',
                    paragraph3: 'در ادامه این جامعه فعالیت خود را در GitHub شروع کرد تا هم فرهنگ توسعه و مشارکت متن باز (Open Source) را در ایران پررنگتر کند و هم افراد جامعه در تعامل با یکدیگر نقص و کمبود‌های این کتابخانه را رفع و راهکارهای خود را با یکدیگر به اشتراک بگذارند.',
                    paragraph4: 'سپس این جامعه فعالیت خود را در اکثر شبکه‌های اجتماعی و محتوایی گسترش داد تا افراد جامعه در همه محیط‌های لازم به محتوا و تعامل‌های ممکن دسترسی داشته باشند.',
                    paragraph5: 'اگر در محیطی فعالیت دارید که جامعه در آن فعال نیست و زمینه فعالیت جامعه را مناسب می‌دانید به شورای جامعه اطلاع دهید تا در آنجا نیز فعالیت به کمک شما آغاز شود.',
                },
                ownerDocument: {
                    title: 'شورای نظارت و حق مالکیت',
                    paragraph1: 'جامعه به هیچ شخص یا گروهی تعلق مالکیتی ندارد و مخالف هر گونه انحصار به شخص یا شرکت است.',
                    paragraph2: 'جامعه به وسیله "شورای نظارت" مدیریت و کنترل می‌شود. حضور هر شخص از اعضای جامعه در این شورا ممکن است و تمدید حضور هر فرد در شورا به میزان فعالیت و مؤثر بودن آن بستگی دارد و به معنای حضور همیشگی نخواهد بود.',
                    paragraph3: 'مدیر کانال‌ها و گروه‌های جامعه از بین اعضای شورا انتخاب خواهند شد.',
                    paragraph4: 'از هر شخص فعال برای حضور در شورا و مدیریت کانال‌ها دعوت خواهد شد و هر شخصی که حس می‌کند صلاحیت حضور در شورا را دارد می‌تواند درخواست عضویت خود را از طریق یکی از اعضای شورا و یا ارسال ایمیل (iran.react.community@gmail.com) به اطلاع شورا برساند.',
                    paragraph5: 'بدیهی است پس از بررسی صلاحیت شخص توسط اعضای شورا ورود یا عدم ورود وی تعیین خواهد شد. ',
                    paragraph6: 'هر شخص حتی اگر عضو شورا نباشد حق انتقاد و ارائه پیشنهاد دارد و اعضای شورا باید به نظرات افراد غیر عضو شورا نیز توجه داشته باشند و در شورا آن را برای اجرا یا عدم اجرا به مشورت بگذارند.',
                    paragraph7: 'هیچ شخص از اعضای شورا حق ندارد بخاطر مشکلات و سلیقه‌های شخصی محتوا، فرد یا فعالیتی را ممنوع و حذف نمایید و لغو عضویت هر شخص بسته به نظر جمع خواهد بود. در صورت مشاهده تخلف به سایر اعضای شورا اطلاع یا شکایت خود را به (iran.react.community@gmail.com) ارسال نمایید.',
                },
                contributing: {
                    title: 'نحـوه عضویـت و مشـارکت',
                    paragraph1: 'از آنجایی که کلیه فعالیت‌ها و محتوا‌ها به فعالیت و مشارکت تک تک اعضای این جامعه بستگی دارد، رشد و پیشرفت آن نیز به همه اعضای آن متعلق خواهد بود.',
                    list: {
                      telegramGroup: {
                          title: 'گروه تلگرام',
                          hint: 'نکته: نیاز به اتصال اینترنت غیر فیلتر می‌باشد.',
                          link: 'https://b2n.ir/ir-react',
                      },
                      telegramChannel: {
                          title: 'کانال تلگرام',
                          hint: 'نکته: نیاز به اتصال اینترنت غیر فیلتر می‌باشد.',
                          link: 'https://t.me/iran_react',
                      },
                      virgool: {
                          title: 'انتشارات ویرگول',
                          hint: 'محل انتشار مقالات آموزشی اعضای جامعه ری‌اکت ایران',
                          link: 'https://virgool.io/iran-react-community',
                      },
                      github: {
                          title: 'گیت‌هاب',
                          hint: 'فرآیند عضویت:',
                          link: 'https://github.com/iran-react-community',
                          steps: {
                              one: 'نام کاربری یا ایمیل حساب کاربری گیت‌هاب خود را برای یکی از اعضای شورا و یا به ایمیل شورا ارسال نمایید.',
                              two: 'بعد از ثبت عضویت به شما اطلاع داده خواهد شد. در این لحظه باید به صفحه سازمانی جامعه در گیت هاب بروید.',
                              three: 'در نوار بالای صفحه روی دکمه invite کلیک کنید تا فرآیند عضویتتان تکمیل گردد.',
                              four: 'حال به تب people در بالای صفحه بروید و حساب خود را که ممکن است در صفحات دیگر باشید را پیدا کرده و در سطر خودتان private را به public تغییر تا افرادی که عضو اورگان هم نیستند شما را به عنوان عضو جامعه مشاهده کنند.',
                          }
                      },
                      twitter: {
                          title: 'توئیتر',
                          hint: 'نکته: نیاز به اتصال اینترنت غیر فیلتر می‌باشد.',
                          link: 'http://twitter.com/iran_react',
                      },
                      instagram: {
                          title: 'اینستاگرام',
                          link: 'http://instagram.com/iran_react',
                      },
                      linkedInGroup: {
                          title: 'گروه لینکداین',
                          hint: 'برای عضویت به صفحه گروه رفته و بر روی دکمه درخواست عضویت کلیک نمایید. ',
                          link: 'https://www.linkedin.com/groups/8742016/',
                      },
                      aparat: {
                          title: 'آپارات',
                          hint: 'محل انتشار ویدیو‌های آموزشی اعضای جامعه ری‌اکت ایران',
                          link: 'https://www.aparat.com/iran_react',
                      },
                    },
                },
            },
        },
    },
};
